syos-web/src/test/jmeter/results/auth_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8703.038,
    "medianResTime" : 9132.5,
    "minResTime" : 2541.0,
    "maxResTime" : 10447.0,
    "pct1ResTime" : 10024.9,
    "pct2ResTime" : 10150.699999999999,
    "pct3ResTime" : 10381.91,
    "throughput" : 10.517569600016829,
    "receivedKBytesPerSec" : 8.564896526835579,
    "sentKBytesPerSec" : 2.578037079691625
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8703.038,
    "medianResTime" : 9132.5,
    "minResTime" : 2541.0,
    "maxResTime" : 10447.0,
    "pct1ResTime" : 10024.9,
    "pct2ResTime" : 10150.699999999999,
    "pct3ResTime" : 10381.91,
    "throughput" : 10.517569600016829,
    "receivedKBytesPerSec" : 8.564896526835579,
    "sentKBytesPerSec" : 2.578037079691625
  }
}