syos-web/src/test/jmeter/results/reports_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 411.99833333333333,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 1688.0,
    "pct1ResTime" : 1535.9,
    "pct2ResTime" : 1603.85,
    "pct3ResTime" : 1655.96,
    "throughput" : 29.086678301337987,
    "receivedKBytesPerSec" : 36.18422547629436,
    "sentKBytesPerSec" : 6.836126866395191
  },
  "Top Products Report" : {
    "transaction" : "Top Products Report",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.054999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.949999999999989,
    "pct3ResTime" : 9.990000000000009,
    "throughput" : 10.005002501250624,
    "receivedKBytesPerSec" : 21.81588841295648,
    "sentKBytesPerSec" : 2.3058404202101053
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1229.8249999999998,
    "medianResTime" : 1310.5,
    "minResTime" : 517.0,
    "maxResTime" : 1688.0,
    "pct1ResTime" : 1620.5,
    "pct2ResTime" : 1644.8,
    "pct3ResTime" : 1670.98,
    "throughput" : 9.69743987587277,
    "receivedKBytesPerSec" : 7.9161982096101635,
    "sentKBytesPerSec" : 2.4148898128394105
  },
  "Sales Summary Report" : {
    "transaction" : "Sales Summary Report",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.115000000000001,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 11.949999999999989,
    "pct3ResTime" : 44.79000000000019,
    "throughput" : 9.983028850953378,
    "receivedKBytesPerSec" : 7.339768487321554,
    "sentKBytesPerSec" : 2.252030922431866
  }
}